InformationRegisters/ДопустимыеФорматыДатПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДопустимыеФорматыДатПродукции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешенаДатаВыработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенМесяцВыработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенГодВыработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаНеизвестнаяДатаВыработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаДатаСрокаГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенМесяцСрокаГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенГодСрокаГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенНеограниченныйСрокГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезСрокаГодности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодвидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодвидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВидыПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТипыПродукции</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодвидыПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПодвидыПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыПродукции</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДопустимыеФорматыДатПродукции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбновлениеИнформационнойБазы

// Монопольный обработчик обновления 2.0.5.1
Процедура ЗаполнитьДопустимыеФорматыДатПродукции() Экспорт
	
	Макет = ПолучитьМакет("Макет");
	Для ТекСтр=2 По Макет.ВысотаТаблицы Цикл
		
		КодТипаПродукции = Макет.Область("R"+ТекСтр+"C2").Текст;
		
		ТипПродукции = Справочники.ТипыПродукции.НайтиПоКоду(Число(КодТипаПродукции));
		
		ВидПродукции    = Справочники.ВидыПродукции.ПустаяСсылка();
		ПодвидПродукции = Справочники.ПодвидыПродукции.ПустаяСсылка();
		
		Если ТипПродукции <> Справочники.ТипыПродукции.ПустаяСсылка() Тогда
			
			GUIDВидаПродукции = Макет.Область("R"+ТекСтр+"C4").Текст;
			
			Если ЗначениеЗаполнено(GUIDВидаПродукции) Тогда
				
				СтруктураПоиска = Новый Структура("GUID_Меркурий", GUIDВидаПродукции);
				СтруктураЗаполнения = Новый Структура;
				СтруктураЗаполнения.Вставить("Владелец"     , ТипПродукции);
				СтруктураЗаполнения.Вставить("GUID_Меркурий", GUIDВидаПродукции);
				СтруктураЗаполнения.Вставить("Наименование" , Макет.Область("R"+ТекСтр+"C3").Текст);
				СтруктураЗаполнения.Вставить("КодТНВЭД"     , Макет.Область("R"+ТекСтр+"C5").Текст);
				
				ВидПродукции = ИнтеграцияВетисAPIСервер.НайтиСоздатьЗаполнитьЭлементСправочника("ВидыПродукции", СтруктураПоиска, СтруктураЗаполнения);
				
				Если ЗначениеЗаполнено(ВидПродукции) Тогда
					
					GUIDПодвидаПродукции = Макет.Область("R"+ТекСтр+"C7").Текст;
					
					Если ЗначениеЗаполнено(GUIDПодвидаПродукции) Тогда
						
						СтруктураПоиска = Новый Структура("GUID_Меркурий", GUIDПодвидаПродукции);
						СтруктураЗаполнения = Новый Структура;
						СтруктураЗаполнения.Вставить("Владелец"     , ВидПродукции);
						СтруктураЗаполнения.Вставить("GUID_Меркурий", GUIDПодвидаПродукции);
						СтруктураЗаполнения.Вставить("Наименование" , Макет.Область("R"+ТекСтр+"C6").Текст);
						СтруктураЗаполнения.Вставить("КодТНВЭД"     , Макет.Область("R"+ТекСтр+"C8").Текст);
						
						ПодвидПродукции = ИнтеграцияВетисAPIСервер.НайтиСоздатьЗаполнитьЭлементСправочника("ПодвидыПродукции", СтруктураПоиска, СтруктураЗаполнения);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ДопустимыеФорматыДатПродукции.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТипПродукции.Установить(ТипПродукции);
			НаборЗаписей.Отбор.ВидПродукции.Установить(ВидПродукции);
			НаборЗаписей.Отбор.ПодвидПродукции.Установить(ПодвидПродукции);
			
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовЗапись = НаборЗаписей.Добавить();
			НовЗапись.ТипПродукции                       = ТипПродукции;
			НовЗапись.ВидПродукции                       = ВидПродукции;
			НовЗапись.ПодвидПродукции                    = ПодвидПродукции;
			НовЗапись.РазрешенаДатаВыработки             = Макет.Область("R"+ТекСтр+"C9").Текст;
			НовЗапись.РазрешенМесяцВыработки             = Макет.Область("R"+ТекСтр+"C10").Текст;
			НовЗапись.РазрешенГодВыработки               = Макет.Область("R"+ТекСтр+"C11").Текст;
			НовЗапись.РазрешенаНеизвестнаяДатаВыработки  = Макет.Область("R"+ТекСтр+"C12").Текст;
			НовЗапись.РазрешенаДатаСрокаГодности         = Макет.Область("R"+ТекСтр+"C13").Текст;
			НовЗапись.РазрешенМесяцСрокаГодности         = Макет.Область("R"+ТекСтр+"C14").Текст;
			НовЗапись.РазрешенГодСрокаГодности           = Макет.Область("R"+ТекСтр+"C15").Текст;
			НовЗапись.РазрешенНеограниченныйСрокГодности = Макет.Область("R"+ТекСтр+"C16").Текст;
			НовЗапись.БезСрокаГодности                   = Макет.Область("R"+ТекСтр+"C17").Текст;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
